examples/single_turbine_kefp/8cD_linUp/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         400;
//endTime         39;

deltaT          1;

writeControl    timeStep;

writeInterval   400;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;


libs 
(
"libatmosphericModels.so" 
"lib_actuatorDiskFoam.so"
"libmyIncompressibleTurbulenceModels.dylib"
);


functions
{
    turbulenceFields1
    {
        type        turbulenceFields;
        libs        ("libfieldFunctionObjects.so");
        field		R;
        writeControl        writeTime;
    }

	wallShearStress1
	{
   		type        wallShearStress;
    	libs        ("libfieldFunctionObjects.so");
    	patches     (".*Wall");
        writeControl        writeTime;	
	}
	yPlus1
	{
    	type        yPlus;
    	libs        ("libfieldFunctionObjects.so");
        writeControl        writeTime;		
	}
}


// ************************************************************************* //
